# GetSubFoldersData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceBrowserData..::..GetSubFoldersData Method
ExternalResourceBrowserData Class See Also
---
Gets the subfolders data under the folder path of the browser data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public IList<ExternalResourceSubFolder> GetSubFoldersData()
```

Visual Basic
---
```text
Public Function GetSubFoldersData As IList(Of ExternalResourceSubFolder)
```

Visual C++
---
```text
public:
IList<ExternalResourceSubFolder^>^ GetSubFoldersData()
```

# ### Return Value
The subfolders data under folder path of the browser data.
# See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace